/*
 * Copyright (C) 2016 ayehninkhine
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
 */
package com.datumbox.opensource.test;

import com.ahk.wordsegmenter.BurmeseWordSegmenter;
import com.datumbox.opensource.predictor.NaiveBayesPredictor;
import java.io.IOException;
import java.util.Map;

/**
 *
 * @author ayehninkhine
 */
public class TestScore {
	public static void main(String args[]) throws IOException
	{
		String text="အစိုးရ_သစ်_၏_ရင်းနှီးမြှုပ်နှံမှု_မူဝါဒ_တွင်_စီးပွားရေးလုပ်ငန်း_များ_ကို_အငြင်းပွား_ဖွယ်_သိမ်းယူ_ခြင်း_မှ_အကာအကွယ်_ပေး_မည်_ဟု_ထည့်သွင်း_ဖော်ပြ_ထား_ကြောင်း_သတင်းရ_ရှိသည်_။_အစိုးရ_သစ်_စီးပွားရေး_မူဝါဒ_၁၂_ချက်_ကို_အထောက်အကူ_ပြု_ရန်_ရည်ရွယ်_၍_ရင်းနှီးမြှုပ်နှံမှု_မူဝါဒ_ကို_အစိုးရ_သစ်_က_ထုတ်ပြန်_ခြင်း_ဖြစ်သည်_ဟု_ဘဏ္ဍာရေး_နှင့်_စီမံကိန်း_ဝန်ကြီးဌာန_က_ဆိုသည်_။_နိုင်ငံတော်_၏_စီးပွားရေး_မူဝါဒ_၁၂_ချက်_ကို_အစိုးရ_သစ်_လက်ထက်_တွင်_ထုတ်ပြန်_ပြီး_သုံး_လ_ကျော်_အကြာ_၌_အဆိုပါ_ရင်းနှီးမြှုပ်နှံမှု_မူဝါဒ_ကို_နိုဝင်ဘာ_၁၉_ရက်_တွင်_ထပ်မံ_ထုတ်ပြန်_ခြင်း_ဖြစ်သည်_။_အဆိုပါ_မူဝါဒ_တွင်_နိုင်ငံခြားသား_လုပ်ငန်းရှင်_နှင့်_ပြည်တွင်း_လုပ်ငန်းရှင်_များ_တန်းတူ_အခွင့်အရေး_ပေး_မည်_ဖြစ်ပြီး_အစိုးရ_၏_ထိန်းကျောင်း_မှု_သည်_လည်း_ကြိုတင်_ခန့်မှန်း_နိုင်_အောင်_ဆောင်ရွက်_ပေး_မည်_ဟု_အစိုးရ_သစ်_က_ကတိပြု_ထားသည်_။_နိုင်ငံတော်_လုံခြုံရေး_၊_ယဉ်ကျေးမှု_နှင့်_လူမှုရေး_ဆိုင်ရာ_ကိစ္စရပ်_များ_တွင်_နိုင်ငံခြားသား_များ_အား_ခွင့်_မ_ပြု_ကြောင်း_နှင့်_ခွင့်_မ_ပြု_ခြင်း_ကို_လည်း_ပွင့်ပွင့်လင်းလင်း_ထုတ်ပြန်ကြေညာ_မည်_ဟု_ဆိုသည်_။_အဆိုပါ_မူဝါဒ_တွင်_လက်ရှိ_အစိုးရ_သည်_ဦးစားပေး_ဆွဲဆောင်မှု_ရင်းနှီးမြှုပ်နှံမှု_ရှစ်_မျိုး_ထုတ်ပြန်_ခဲ့_သည်_။_၎င်း_တို့_မှာ_တန်ဖိုး_မြင့်_လယ်ယာ_ထုတ်ကုန်_၊_နည်းပညာ_လုပ်ငန်း_များ_၊_အသေးစား_အလတ်စား_လုပ်ငန်း_များ_နှင့်_အခြေခံ_အဆောက်အအုံ_ဖွံ့ဖြိုးရေး_လုပ်ငန်း_များ_၊_ဖွံ့ဖြိုးမှု_နည်းပါး_သည့်_ဒေသ_များ_တွင်_ရင်းနှီးမြှုပ်နှံ_မည့်_လုပ်ငန်း_များ_၊_အလုပ်အကိုင်_အခွင့်အလမ်း_ဖန်တီး_ပေး_မည့်_လုပ်ငန်း_များ_၊_စက်မှု_မြို့တော်_နှင့်_အစု_အဖွဲ့_စီးပွားရေးလုပ်ငန်း_နှင့်_ခရီးသွားလုပ်ငန်း_များ_တွင်_ရင်းနှီးမြှုပ်နှံမှု_လုပ်ငန်း_များ_ကို_ဦးစားပေး_ကြိုဆို_မည်_ဟု_အစိုးရ_က_ထုတ်ပြန်_သည့်_ကြေညာချက်_တွင်_ဖော်ပြ_ထားသည်_။";
                String original="အစိုးရသစ်၏ရင်းနှီးမြှုပ်နှံမှုမူဝါဒတွင်စီးပွားရေးလုပ်ငန်းများကိုအငြင်းပွားဖွယ်သိမ်းယူခြင်းမှအကာအကွယ်ပေးမည်ဟုထည့်သွင်းဖော်ပြထားကြောင်းသတင်းရရှိသည်။\n" +
"အစိုးရသစ်စီးပွားရေးမူဝါဒ၁၂ချက်ကိုအထောက်အကူပြုရန်ရည်ရွယ်၍ရင်းနှီးမြှုပ်နှံမှုမူဝါဒကိုအစိုးရသစ်ကထုတ်ပြန်ခြင်းဖြစ်သည်ဟုဘဏ္ဍာရေးနှင့်စီမံကိန်းဝန်ကြီးဌာနကဆိုသည်။\n" +
"နိုင်ငံတော်၏စီးပွားရေးမူဝါဒ၁၂ချက်ကိုအစိုးရသစ်လက်ထက်တွင်ထုတ်ပြန်ပြီးသုံးလကျော်အကြာ၌အဆိုပါရင်းနှီးမြှုပ်နှံမှုမူဝါဒကိုနိုဝင်ဘာ၁၉ရက်တွင်ထပ်မံထုတ်ပြန်ခြင်းဖြစ်သည်။\n" +
"အဆိုပါမူဝါဒတွင်နိုင်ငံခြားသားလုပ်ငန်းရှင်နှင့်ပြည်တွင်းလုပ်ငန်းရှင်များတန်းတူအခွင့်အရေးပေးမည်ဖြစ်ပြီးအစိုးရ၏ထိန်းကျောင်းမှုသည်လည်းကြို\n" +
"တင်ခန့်မှန်းနိုင်အောင်ဆောင်ရွက်ပေးမည်ဟုအစိုးရသစ်ကကတိပြုထားသည်။နိုင်ငံတော်လုံခြုံရေး၊\n" +
"ယဉ်ကျေးမှုနှင့်လူမှုရေးဆိုင်ရာကိစ္စရပ်များတွင်နိုင်ငံခြားသားများအားခွင့်မပြုကြောင်းနှင့်ခွင့်မပြုခြင်းကိုလည်းပွင့်ပွင့်လင်းလင်းထုတ်ပြန်ကြေညာမည်ဟုဆိုသည်။\n" +
"အဆိုပါမူဝါဒတွင်လက်ရှိအစိုးရသည်ဦးစားပေးဆွဲဆောင်မှုရင်းနှီးမြှုပ်နှံမှုရှစ်မျိုးထုတ်ပြန်ခဲ့သည်။၎င်းတို့မှာတန်ဖိုးမြင့်လယ်ယာထုတ်ကုန်၊နည်းပညာလုပ်ငန်းများ၊\n" +
"အသေးစားအလတ်စားလုပ်ငန်းများနှင့်အခြေခံအဆောက်အအုံဖွံ့ဖြိုးရေးလုပ်ငန်းများ၊ဖွံ့ဖြိုးမှုနည်းပါးသည့်ဒေသများတွင်ရင်းနှီးမြှုပ်နှံမည့်လုပ်ငန်းများ၊\n" +
"အလုပ်အကိုင်အခွင့်အလမ်းဖန်တီးပေးမည့်လုပ်ငန်းများ၊စက်မှုမြို့တော်နှင့်အစုအဖွဲ့စီးပွားရေးလုပ်ငန်းနှင့်ခရီးသွားလုပ်ငန်းများတွင်ရင်းနှီးမြှုပ်နှံမှုလုပ်ငန်းများကို\n" +
"ဦးစားပေးကြိုဆိုမည်ဟုအစိုးရကထုတ်ပြန်သည့်ကြေညာချက်တွင်ဖော်ပြထားသည်။";
                original=original.replaceAll("\n", "");
                original=original.replaceAll(" ", "");
                original=new BurmeseWordSegmenter().segment(original);
                //System.out.println(text.length());
               // System.out.println(original.length());
                if(!original.equals(text))
                    System.out.println(original);
		NaiveBayesPredictor obj=new NaiveBayesPredictor();
		Map<String,Double> map=obj.getCategoryScores(original);
		System.out.println(map);
	}
        
}
